[
  {
    "name": "Laryngeal",
    "informationText": "The larynx, also known as the voice box, is a muscular organ located in the upper part of the neck. It plays a vital role in the respiratory and digestive systems, as well as in speech production. The larynx connects the pharynx (throat) to the trachea (windpipe) and helps to regulate the flow of air into the lungs. It also contains the vocal cords, which vibrate to produce sound. The larynx also protects the airways from foreign objects and prevents food from entering the lungs during swallowing. In humans, the larynx is also involved in speech production, as the movement and tension of the vocal cords can be controlled to produce different sounds.",
    "category": "skeletalSystem",
    "subModels": {
      "Arytenoid_Cartilage": "",
      "Corniculate_Cartilage": "",
      "Cricoid_Cartilage": "",
      "Hyoid_Bone": "",
      "Thyroid_Cartilage": ""
    }
  },
  {
    "name": "Chest",
    "informationText": "The rib cage is a bony structure located in the thorax (chest) that surrounds and protect the vital organs, such as the lungs, heart, and major blood vessels. It is made up of the sternum, costal bones, and thoracic vertebrae. The rib cage is connected to the spine and the sternum (breastbone) in the front of the thorax, forming a sturdy and flexible cage-like structure.\nThe rib cage has 12 pairs of ribs, each of which attach to the thoracic vertebrae in the back and the sternum in the front. The first 7 pairs of ribs are called `true ribs` because they attach directly to the sternum via the costal cartilage. The next 3 pairs are called `false ribs` because they attach indirectly to the sternum, via the costal cartilage of the ribs above them. The last 2 pairs are called `floating ribs` because they do not attach to the sternum at all.",
    "category": "skeletalSystem",
    "subModels": {
      "Manubrium": "The manubrium (Latin for 'handle') is the broad upper part of the sternum. It has a quadrangular shape, narrowing from the top, which gives it four borders. The suprasternal notch (jugular notch) is located in the middle at the upper broadest part of the manubrium. This notch can be felt between the two clavicles. On either side of this notch are the right and left clavicular notches. The manubrium joins with the body of the sternum, the clavicles and the cartilages of the first pair of ribs. The inferior border, oval and rough, is covered with a thin layer of cartilage for articulation with the body. The lateral borders are each marked above by a depression for the first costal cartilage, and below by a small facet, which, with a similar facet on the upper angle of the body, forms a notch for the reception of the costal cartilage of the second rib. Between the depression for the first costal cartilage and the demi-facet for the second is a narrow, curved edge, which slopes from above downward towards the middle. Also, the superior sternopericardial ligament attaches the pericardium to the posterior side of the manubrium.",
      "Rib_cage": "The rib cage is a series of bones in the chest that protect the organs in the thorax, including the heart and lungs. It is made up of 12 pairs of ribs, the sternum, and the thoracic vertebrae. The ribs are attached to the spine at the back and to the sternum at the front. The upper seven pairs of ribs are called 'true ribs' because they are directly attached to the sternum. The next three pairs are called 'false ribs' because they are not directly attached to the sternum, but instead are attached to the ribs above them. The last two pairs are called 'floating ribs' because they are only attached at the back and do not connect to the sternum at all. The rib cage is important for protecting the organs in the thorax and for helping the body to breathe.",
      "Sternum": "The longest sternal part. It is flat and considered to have only a front and back surface. It is flat on the front, directed upward and forward, and marked by three transverse ridges which cross the bone opposite the third, fourth, and fifth articular depressions. The pectoralis major attaches to it on either side. At the junction of the third and fourth parts of the body is occasionally seen an orifice, the sternal foramen, of varying size and form. The posterior surface, slightly concave, is also marked by three transverse lines, less distinct, however, than those in front; from its lower part, on either side, the transversus thoracis takes origin. The sternal angle is located at the point where the body joins the manubrium. The sternal angle can be felt at the point where the sternum projects farthest forward. However, in some people the sternal angle is concave or rounded. During physical examinations, the sternal angle is a useful landmark because the second rib attaches here. Each outer border, at its superior angle, has a small facet, which with a similar facet on the manubrium, forms a cavity for the cartilage of the second rib; below this are four angular depressions which receive the cartilages of the third, fourth, fifth, and sixth ribs. The inferior angle has a small facet, which, with a corresponding one on the xiphoid process, forms a notch for the cartilage of the seventh rib. These articular depressions are separated by a series of curved interarticular intervals, which diminish in length from above downward, and correspond to the intercostal spaces. Most of the cartilages belonging to the true ribs, articulate with the sternum at the lines of junction of its primitive component segments. This is well seen in some other vertebrates, where the parts of the bone remain separated for longer. The upper border is oval and articulates with the manubrium, at the sternal angle. The lower border is narrow, and articulates with the xiphoid process.",
      "Xiphoid_Process": "Located at the inferior end of the sternum is the pointed xiphoid process. Improperly performed chest compressions during cardiopulmonary resuscitation can cause the xiphoid process to snap off, driving it into the liver which can cause a fatal hemorrhage. The sternum is composed of highly vascular tissue, covered by a thin layer of compact bone which is thickest in the manubrium between the articular facets for the clavicles. The inferior sternopericardial ligament attaches the pericardium to the posterior xiphoid process."
    }
  },
  {
    "name": "Skull",
    "informationText": "The skull is a bony structure that forms the head and face in vertebrates. It serves to protect the brain, provide attachment points for muscles, and support the sense organs such as the eyes and ears. The skull is made up of several bones that are fused together, including the frontal bone, parietal bones, temporal bones, and occipital bone. The skull also includes several openings, such as the orbits for the eyes, the nasal cavity, and the auditory canals for the ears. In mammals, the skull also includes the jaw bones, which are used for biting and chewing food. The structure and shape of the skull can vary greatly among different species, reflecting the different adaptations and evolutionary pressures that have shaped them over time.",
    "category": "skeletalSystem",
    "subModels": {
      
    }
  },
  {
    "name": "Arm",
    "informationText": "The arm is made up of three bones: the humerus, radius, and ulna. The humerus is the bone that runs from the shoulder to the elbow and is the largest bone in the arm. The radius and ulna are the bones that run from the elbow to the wrist. The radius is located on the thumb side of the arm and the ulna is located on the little finger side.\nThe shoulder joint, which connects the arm to the torso, is formed by the head of the humerus and the scapula. The elbow joint, which connects the arm to the forearm, is formed by the humerus, radius, and ulna. The wrist is formed by the radius and ulna connecting to the bones of the hand.\nThe arm bones are supported by a network of muscles, tendons, and ligaments that work together to allow for a wide range of movements such as lifting, reaching, and grasping. The bones of the arm also protect the nerves and blood vessels that travel through the arm, allowing for the sensation and movement of the hand and fingers.",
    "category": "skeletalSystem",
    "subModels": {
      "Humerus": "",
      "Radius": "",
      "Ulna": ""
    }
  },
  {
    "name": "Foot",
    "informationText": "The foot is made up of several bones that work together to provide support, stability, and mobility. The foot is divided into three parts: the hindfoot, the midfoot, and the forefoot.\nThe hindfoot is composed of the heel bone (calcaneus) and the ankle bone (talus). The heel bone is the largest bone in the foot and provides a stable base for the foot. The ankle bone sits on top of the heel bone and forms the ankle joint, which allows for up and down movement of the foot.\nThe midfoot is composed of the arch bones (navicular, cuboid, and cuneiforms) and the metatarsals. These bones form the arch of the foot and provide support and shock absorption.\nThe forefoot is composed of the bones of the toes (phalanges) and the bones that connect them to the rest of the foot (metatarsals). These bones form the toes and allow for grasping and fine motor movements.",
    "category": "skeletalSystem",
    "subModels": {
      "Calcaneus": "",
      "Cuboid": "",
      "Intermediate_Cuneiform": "",
      "Lateral_Cuneiform": "",
      "Medial_Cuneiform": "",
      "Metatarsal": "",
      "Navicular_Bone": "",
      "Phalanx": "",
      "Sesamoid": "",
      "Talus": ""
    }
  },
  {
    "name": "Hand",
    "informationText": "The hand is made up of many bones that work together to provide support, stability, and mobility. The bones of the hand are divided into three parts: the carpals (wrist bones), metacarpals (hand bones) and phalanges (finger bones).\nThe carpals are eight small bones located at the base of the hand that form the wrist joint. They are the Scaphoid, Lunate, Triquetral, Pisiform, Trapezium, Trapezoid, Capitate, and Hamate.\nThe metacarpals are five long bones that run from the carpals to the phalanges and form the bones of the hand. They are numbered 1-5, starting from the thumb. The metacarpals provide support and stability to the hand and also serve as attachment points for the muscles that control the movement of the fingers.\nThe phalanges are the bones that form the fingers and thumb. Each finger has three phalanges: the proximal, middle, and distal phalanges. The thumb only has two phalanges. These bones provide the fine motor movements and dexterity needed for tasks such as grasping and manipulating objects.",
    "category": "skeletalSystem",
    "subModels": {
      "Capitate": "",
      "Hamate": "",
      "Lunate": "",
      "Metacarpal": "",
      "Phalanx": "",
      "Pisiform": "",
      "Scaphoid": "",
      "Trapezium": "",
      "Trapezoid": "",
      "Triquetrum": ""
    }
  },
  {
    "name": "Leg",
    "informationText": "The leg is made up of two bones: the femur and the tibia and fibula. The femur is the thigh bone and is the longest and strongest bone in the body. It runs from the hip to the knee and forms the hip joint at the top and the knee joint at the bottom. The tibia and fibula are the bones that run from the knee to the ankle and form the knee joint. The tibia is the larger of the two bones and is located on the inner side of the leg, while the fibula is a smaller bone located on the outer side of the leg.\nThe bones of the leg are supported by a network of muscles, tendons, and ligaments that work together to allow for a wide range of movements such as walking, running, and jumping. The bones of the leg also protect the nerves and blood vessels that travel through the leg, allowing for sensation and movement of the foot and toes.",
    "category": "skeletalSystem",
    "subModels": {
      "Femur": "",
      "Fibula": "",
      "Patella": "",
      "Tibia": ""
    }
  },
  {
    "name": "Pelvic_Girdle",
    "informationText": "The pelvic girdle is a bony structure that forms the foundation of the spine and supports the upper body. It is made up of two hip bones (os coxae), which connect to the sacrum, a triangular bone at the base of the spine. The hip bones are formed by the fusion of three bones: the ilium, ischium, and pubis.\nThe pelvic girdle serves several important functions, including providing a stable base for the spine and supporting the weight of the upper body. It also serves as the attachment point for several muscles, including those of the hip, thigh, and lower back. These muscles work together to allow for a wide range of movements such as walking, running, and jumping.",
    "category": "skeletalSystem",
    "subModels": {
      "Hip": ""
    }
  },
  {
    "name": "Shoulder_Girdle",
    "informationText": "The shoulder girdle, also known as the pectoral girdle, is a bony structure that connects the upper limb (arm) to the trunk of the body. It is made up of two bones: the scapula (shoulder blade) and the clavicle (collarbone). The scapula is a flat, triangular bone that sits on the back of the chest wall, while the clavicle is a long, slender bone that runs from the sternum (breastbone) to the scapula.\nThe shoulder girdle serves several important functions, including providing a stable base for the arm, allowing for a wide range of movements such as lifting, reaching, and grasping. The bones of the shoulder girdle also serve as the attachment point for several muscles, including those of the chest, back, and arm. These muscles work together to allow for movement and stability of the shoulder joint.",
    "category": "skeletalSystem",
    "subModels": {
      "Clavicle": "",
      "Scapula": ""
    }
  },
  {
    "name": "Vertebral_Column",
    "informationText": "The vertebral column is divided into five regions: cervical, thoracic, lumbar, sacral, and coccygeal. Each region has a different number of vertebrae and performs different functions. The cervical region, for example, has 7 vertebrae, it is the most mobile and flexible region of the spine, allowing for the head to move in all directions. The thoracic region has 12 vertebrae, it is the most stable region, and it connects the ribcage to the spine. The lumbar region has 5 vertebrae, it is the most susceptible to stress, and it supports most of the body's weight. The sacral region has 5 fused vertebrae, it forms the back of the pelvic girdle and it has limited movement. The coccygeal region has 4 fused vertebrae, it forms the tailbone, and it doesn't have any movement.",
    "category": "skeletalSystem",
    "subModels": {
      "Atlas": "The atlas, also known as the first cervical vertebra or C1, is a unique vertebra in the neck region of the vertebral column. It is located between the skull and the second cervical vertebra (C2), and is the first of the seven cervical vertebrae. The atlas is named after the Greek god Atlas, who was known for holding up the world on his shoulders. Like the mythical Atlas, the atlas has a special role in supporting and stabilizing the head. The atlas is a small, ring-shaped vertebra that has no vertebral body or spinous process (a bony projection on the back of the vertebra). Instead, it has a pair of bony processes called the lateral masses, which provide attachment points for muscles and ligaments. The atlas also has a distinctive feature called the dens, which is a bony protuberance that extends upward from the vertebral body of the second cervical vertebra (C2). The head pivots around the dens when it moves, allowing the head to rotate and tilt in all directions.",
      "Axis": "The axis, also known as the second cervical vertebra or C2, is a unique vertebra in the neck region of the vertebral column. It is located between the atlas (C1) and the third cervical vertebra (C3) and is the second of the seven cervical vertebrae. The axis is named after the Greek god Atlas, who was known for holding up the world on his shoulders. Like the atlas, the axis has a special role in supporting and stabilizing the head. The axis has a distinctive feature called the odontoid process, also known as the dens, which is a bony protuberance that extends upward from the vertebral body. The atlas pivots around the dens when the head moves, allowing the head to rotate and tilt in all directions. The axis also has a number of bony processes, including the transverse processes, which provide attachment points for muscles and ligaments.",
      "Cervical_Vertebra": "The cervical vertebrae are a group of seven bones located in the neck region of the vertebral column. They are also known as the C-vertebrae. The cervical vertebrae are the smallest and most delicate of the vertebrae, as they are responsible for supporting the weight of the head and allowing it to move freely. They are also responsible for protecting the spinal cord, which runs through the vertebral foramen (a hole in the center of each vertebra) and carries messages between the brain and the rest of the body. Each cervical vertebra has a body, which is the main weight-bearing part of the bone, and a number of bony processes, which are protuberances that provide attachment points for muscles and ligaments. The vertebral body is round in shape and has a concave area on its back side, called the vertebral foramen, through which the spinal cord passes. The cervical vertebrae are separated from each other by intervertebral discs, which are made of cartilage and act as shock absorbers to protect the spine from damage.",
      "Coccyx": "The coccyx (plural: coccyges or coccyxes), commonly referred to as the tailbone, is the final segment of the vertebral column in all apes, and analogous structures in certain other mammals such as horses. In tailless primates (e.g. humans and other great apes) since Nacholapithecus (a Miocene hominoid), the coccyx is the remnant of a vestigial tail. In animals with bony tails, it is known as tailhead or dock, in bird anatomy as tailfan. It comprises three to five separate or fused coccygeal vertebrae below the sacrum, attached to the sacrum by a fibrocartilaginous joint, the sacrococcygeal symphysis, which permits limited movement between the sacrum and the coccyx.",
      "Lumbar_Vertebra": "The lumbar vertebrae are, in human anatomy, the five vertebrae between the rib cage and the pelvis. They are the largest segments of the vertebral column and are characterized by the absence of the foramen transversarium within the transverse process (since it is only found in the cervical region) and by the absence of facets on the sides of the body (as found only in the thoracic region). They are designated L1 to L5, starting at the top. The lumbar vertebrae help support the weight of the body, and permit movement.",
      "Sacrum": "The sacrum (plural: sacra or sacrums), in human anatomy, is a large, triangular bone at the base of the spine that forms by the fusing of the sacral vertebrae (S1–S5) between ages 18 and 30.The sacrum situates at the upper, back part of the pelvic cavity, between the two wings of the pelvis. It forms joints with four other bones. The two projections at the sides of the sacrum are called the alae (wings), and articulate with the ilium at the L-shaped sacroiliac joints. The upper part of the sacrum connects with the last lumbar vertebra (L5), and its lower part with the coccyx (tailbone) via the sacral and coccygeal cornua. The sacrum has three different surfaces which are shaped to accommodate surrounding pelvic structures. Overall it is concave (curved upon itself). The base of the sacrum, the broadest and uppermost part, is tilted forward as the sacral promontory internally. The central part is curved outward toward the posterior, allowing greater room for the pelvic cavity. In all other quadrupedal vertebrates, the pelvic vertebrae undergo a similar developmental process to form a sacrum in the adult, even while the bony tail (caudal) vertebrae remain unfused.",
      "Thoracic_Vertebra": "The thoracic vertebrae are a group of 12 bones in the vertebral column that are located in the chest region, between the cervical vertebrae in the neck and the lumbar vertebrae in the lower back. They are also known as the T-vertebrae. The thoracic vertebrae are larger and stronger than the cervical vertebrae, but smaller and less massive than the lumbar vertebrae. They are designed to support the weight of the upper body and to provide a stable foundation for the rib cage. Each thoracic vertebra has a body, which is the main weight-bearing part of the bone, and a number of bony processes, which are protuberances that provide attachment points for muscles and ligaments. The vertebral body is oval in shape and has a concave area on its back side, called the vertebral foramen, through which the spinal cord passes. The thoracic vertebrae are separated from each other by intervertebral discs, which are made of cartilage and act as shock absorbers to protect the spine from damage."
    }
  }
]
