[
  {
    "name": "Laryngeal",
    "informationText": "The larynx, also known as the voice box, is a muscular organ located in the upper part of the neck. It plays a vital role in the respiratory and digestive systems, as well as in speech production. The larynx connects the pharynx (throat) to the trachea (windpipe) and helps to regulate the flow of air into the lungs. It also contains the vocal cords, which vibrate to produce sound.\nThe larynx also protects the airways from foreign objects and prevents food from entering the lungs during swallowing. In humans, the larynx is also involved in speech production, as the movement and tension of the vocal cords can be controlled to produce different sounds.",
    "category": "skeletalSystem",
    "subModels": {
      "Arytenoid_Cartilage": "The Arytenoid Cartilage is a paired cartilaginous structure located in the larynx, which is the voice box in humans. It plays a crucial role in the production of sound during speech and singing. Specifically, it is situated near the vocal cords and is attached to the cricoid cartilage. This cartilage has several vital functions in the larynx, such as adjusting the tension and position of the vocal cords, which is necessary for controlling the pitch and volume of sound during speech and singing. Additionally, it helps to regulate the flow of air through the larynx and into the lungs, which is essential for efficient breathing.",
      "Corniculate_Cartilage": "The Corniculate Cartilage is a small, paired structure located on top of the arytenoid cartilage in the larynx. It is composed of elastic cartilage and is shaped like a horn or a cone. The corniculate cartilage serves as an attachment point for the aryepiglottic muscle, which is responsible for helping to close the opening to the larynx during swallowing.",
      "Cricoid_Cartilage": "The Cricoid Cartilage is a ring-shaped structure located at the top of the trachea (windpipe) in the neck. It serves as a support for the larynx and is an important structure involved in breathing and swallowing. The cricoid cartilage can be visualized during medical procedures, such as a laryngoscopy, to diagnose any issues with the larynx.",
      "Hyoid_Bone": "The Hyoid Bone is a U-shaped bone located in the neck between the chin and the thyroid cartilage. It is the only bone in the human body that is not directly connected to any other bones. The hyoid bone plays an important role in supporting the tongue and the muscles involved in swallowing and speaking. It also serves as an attachment point for several muscles in the neck and shoulders. In certain medical procedures, such as a laryngoscopy or a thyroidectomy, the position and movement of the hyoid bone may be observed to diagnose any issues in the neck or throat.",
      "Thyroid_Cartilage": "The Thyroid Cartilage is the largest cartilage in the larynx and is commonly known as the 'Adam's apple.' It is located at the front of the neck and forms the anterior wall of the larynx. The thyroid cartilage plays an important role in protecting the vocal cords and the structures of the larynx. It also helps to regulate the tension and position of the vocal cords during speech and singing."
    }
  },
  {
    "name": "Chest",
    "informationText": "The rib cage is a bony structure located in the thorax (chest) that surrounds and protect the vital organs, such as the lungs, heart, and major blood vessels. It is made up of the sternum, costal bones, and thoracic vertebrae.\nThe first 7 pairs of ribs are called `true ribs` because they attach directly to the sternum via the costal cartilage. The next 3 pairs are called `false ribs` because they attach indirectly to the sternum, via the costal cartilage of the ribs above them. The last 2 pairs are called `floating ribs` because they do not attach to the sternum at all.",
    "category": "skeletalSystem",
    "subModels": {
      "Manubrium": "The manubrium (Latin for 'handle') is the broad upper part of the sternum. It has a quadrangular shape, narrowing from the top, which gives it four borders. The suprasternal notch (jugular notch) is located in the middle at the upper broadest part of the manubrium. This notch can be felt between the two clavicles. On either side of this notch are the right and left clavicular notches. The manubrium joins with the body of the sternum, the clavicles and the cartilages of the first pair of ribs. The inferior border, oval and rough, is covered with a thin layer of cartilage for articulation with the body. The lateral borders are each marked above by a depression for the first costal cartilage, and below by a small facet, which, with a similar facet on the upper angle of the body, forms a notch for the reception of the costal cartilage of the second rib. Between the depression for the first costal cartilage and the demi-facet for the second is a narrow, curved edge, which slopes from above downward towards the middle. Also, the superior sternopericardial ligament attaches the pericardium to the posterior side of the manubrium.",
      "Rib_cage": "The rib cage is a series of bones in the chest that protect the organs in the thorax, including the heart and lungs. It is made up of 12 pairs of ribs, the sternum, and the thoracic vertebrae. The ribs are attached to the spine at the back and to the sternum at the front. The upper seven pairs of ribs are called 'true ribs' because they are directly attached to the sternum. The next three pairs are called 'false ribs' because they are not directly attached to the sternum, but instead are attached to the ribs above them. The last two pairs are called 'floating ribs' because they are only attached at the back and do not connect to the sternum at all. The rib cage is important for protecting the organs in the thorax and for helping the body to breathe.",
      "Sternum": "The longest sternal part. It is flat and considered to have only a front and back surface. It is flat on the front, directed upward and forward, and marked by three transverse ridges which cross the bone opposite the third, fourth, and fifth articular depressions. The pectoralis major attaches to it on either side. At the junction of the third and fourth parts of the body is occasionally seen an orifice, the sternal foramen, of varying size and form. The posterior surface, slightly concave, is also marked by three transverse lines, less distinct, however, than those in front; from its lower part, on either side, the transversus thoracis takes origin. The sternal angle is located at the point where the body joins the manubrium. The sternal angle can be felt at the point where the sternum projects farthest forward. However, in some people the sternal angle is concave or rounded. During physical examinations, the sternal angle is a useful landmark because the second rib attaches here. Each outer border, at its superior angle, has a small facet, which with a similar facet on the manubrium, forms a cavity for the cartilage of the second rib; below this are four angular depressions which receive the cartilages of the third, fourth, fifth, and sixth ribs. The inferior angle has a small facet, which, with a corresponding one on the xiphoid process, forms a notch for the cartilage of the seventh rib. These articular depressions are separated by a series of curved interarticular intervals, which diminish in length from above downward, and correspond to the intercostal spaces. Most of the cartilages belonging to the true ribs, articulate with the sternum at the lines of junction of its primitive component segments. This is well seen in some other vertebrates, where the parts of the bone remain separated for longer. The upper border is oval and articulates with the manubrium, at the sternal angle. The lower border is narrow, and articulates with the xiphoid process.",
      "Xiphoid_Process": "Located at the inferior end of the sternum is the pointed xiphoid process. Improperly performed chest compressions during cardiopulmonary resuscitation can cause the xiphoid process to snap off, driving it into the liver which can cause a fatal hemorrhage. The sternum is composed of highly vascular tissue, covered by a thin layer of compact bone which is thickest in the manubrium between the articular facets for the clavicles. The inferior sternopericardial ligament attaches the pericardium to the posterior xiphoid process."
    }
  },
  {
    "name": "Skull",
    "informationText": "The skull is a bony structure that forms the head and face in vertebrates. It serves to protect the brain, provide attachment points for muscles, and support the sense organs such as the eyes and ears. The skull is made up of several bones that are fused together, including the frontal bone, parietal bones, temporal bones, and occipital bone. The skull also includes several openings, such as the orbits for the eyes, the nasal cavity, and the auditory canals for the ears. In mammals, the skull also includes the jaw bones, which are used for biting and chewing food. The structure and shape of the skull can vary greatly among different species, reflecting the different adaptations and evolutionary pressures that have shaped them over time.",
    "category": "skeletalSystem",
    "subModels": {
      
    }
  },
  {
    "name": "Arm",
    "informationText": "The arm is made up of three bones: the humerus, radius, and ulna. The humerus is the bone that runs from the shoulder to the elbow and is the largest bone in the arm. The radius and ulna are the bones that run from the elbow to the wrist. The radius is located on the thumb side of the arm and the ulna is located on the little finger side. The shoulder joint, which connects the arm to the torso, is formed by the head of the humerus and the scapula.\nThe elbow joint, which connects the arm to the forearm, is formed by the humerus, radius, and ulna.The wrist is formed by the radius and ulna connecting to the bones of the hand.",
    "category": "skeletalSystem",
    "subModels": {
      "Humerus": "The Humerus is a long bone located in the upper arm and is the largest bone in the human upper body. It has a unique shape with a round head that fits into the shoulder joint and a narrower shaft that connects to the elbow joint. The humerus plays an important role in the movement and stability of the arm and is involved in many everyday activities such as lifting, pushing, and throwing. It is also an important site of attachment for several muscles involved in arm movement. Injuries to the humerus can result in pain, weakness, and limited range of motion in the arm.",
      "Radius": "The Radius is one of the two bones in the forearm, located on the thumb side of the arm. It is a long, thin bone that runs from the elbow to the wrist and plays an important role in the movement of the forearm and hand. The radius is involved in rotation of the forearm, allowing the palm to face up or down, and it also contributes to the stability of the wrist joint. The distal end of the radius forms part of the wrist joint and is involved in movements such as flexion and extension of the hand. Injuries to the radius can result in pain, swelling, and limited movement in the forearm and hand.",
      "Ulna": "The Ulna is the other bone in the forearm, located on the pinky side of the arm. It is a long, thin bone that runs from the elbow to the wrist and works in tandem with the radius to allow for movement of the forearm and hand. The ulna is involved in the stability of the elbow joint and provides attachment sites for several muscles involved in wrist and hand movement. The distal end of the ulna is also involved in the formation of the wrist joint and is important in movements such as rotation and bending of the hand. Injuries to the ulna can result in pain, swelling, and limited movement in the forearm and hand."
    }
  },
  {
    "name": "Foot",
    "informationText": "The foot is divided into three parts: the hindfoot, the midfoot, and the forefoot.The hindfoot is composed of the heel bone (calcaneus) and the ankle bone (talus). The heel bone is the largest bone in the foot and provides a stable base for the foot. The ankle bone sits on top of the heel bone and forms the ankle joint, which allows for up and down movement of the foot.\nThe midfoot is composed of the arch bones (navicular, cuboid, and cuneiforms) and the metatarsals.\nThese bones form the arch of the foot and provide support and shock absorption.\nThe forefoot is composed of the bones of the toes (phalanges) and the bones that connect them to the rest of the foot (metatarsals).",
    "category": "skeletalSystem",
    "subModels": {
      "Calcaneus": "The calcaneus, also known as the heel bone, is the largest bone in the foot. It is located at the back of the foot, forming the heel and connecting to the ankle bone (talus) and the cuboid bone. The calcaneus plays an important role in weight-bearing and shock absorption during movement, and provides attachment sites for muscles, ligaments, and tendons involved in foot function. Injuries to the calcaneus can occur due to direct trauma, overuse, or stress fractures, and may result in pain, swelling, and limited mobility. Treatment for calcaneus injuries depends on the severity of the injury and may include rest, immobilization, physical therapy, and in some cases, surgery.",
      "Cuboid": "The cuboid bone is a small cube-shaped bone located in the lateral (outer) side of the foot. It forms a joint with the heel bone (calcaneus) and connects to the fourth and fifth metatarsal bones, as well as the lateral cuneiform bone. The cuboid plays an important role in the support and stability of the foot arch, and provides attachment sites for muscles, ligaments, and tendons involved in foot function. Injuries to the cuboid bone can occur due to direct trauma, overuse, or stress fractures, and may result in pain, swelling, and limited mobility. Treatment for cuboid injuries depends on the severity of the injury and may include rest, immobilization, physical therapy, and in some cases, surgery.",
      "Intermediate_Cuneiform": "The intermediate cuneiform is one of the three cuneiform bones located in the midfoot region of the foot. It is located between the medial and lateral cuneiform bones, and is shaped like a wedge. The intermediate cuneiform plays an important role in the support and stability of the foot arch, and provides attachment sites for muscles, ligaments, and tendons involved in foot function. Injuries to the intermediate cuneiform can occur due to direct trauma, overuse, or stress fractures, and may result in pain, swelling, and limited mobility. Treatment for intermediate cuneiform injuries depends on the severity of the injury and may include rest, immobilization, physical therapy, and in some cases, surgery.",
      "Lateral_Cuneiform": "The lateral cuneiform is one of the three cuneiform bones located in the midfoot region of the foot. It is located on the lateral (outer) side of the foot, and is shaped like a wedge. The lateral cuneiform plays an important role in the support and stability of the foot arch, and provides attachment sites for muscles, ligaments, and tendons involved in foot function. Injuries to the lateral cuneiform can occur due to direct trauma, overuse, or stress fractures, and may result in pain, swelling, and limited mobility. Treatment for lateral cuneiform injuries depends on the severity of the injury and may include rest, immobilization, physical therapy, and in some cases, surgery.",
      "Medial_Cuneiform": "The medial cuneiform is one of the three cuneiform bones located in the midfoot region of the foot. It is located on the medial (inner) side of the foot, and is shaped like a wedge. The medial cuneiform plays an important role in the support and stability of the foot arch, and provides attachment sites for muscles, ligaments, and tendons involved in foot function. Injuries to the medial cuneiform can occur due to direct trauma, overuse, or stress fractures, and may result in pain, swelling, and limited mobility. Treatment for medial cuneiform injuries depends on the severity of the injury and may include rest, immobilization, physical therapy, and in some cases, surgery.",
      "Metatarsal": "Metatarsals are the five long bones located in the midfoot region of the foot, connecting the toes to the ankle. They are numbered from one to five, with the first metatarsal being the largest and thickest, and the fifth being the smallest and thinnest. The metatarsals play an important role in the support and movement of the foot, and provide attachment sites for muscles, ligaments, and tendons involved in foot function. Injuries to the metatarsals can occur due to direct trauma, overuse, or stress fractures, and may result in pain, swelling, and limited mobility. Treatment for metatarsal injuries depends on the severity of the injury and may include rest, immobilization, physical therapy, and in some cases, surgery.",
      "Navicular_Bone": "The navicular bone is a small, boat-shaped bone located in the ankle, on the inside of the foot. It plays an important role in the stability and mobility of the foot and ankle joint. The navicular bone helps to transmit weight from the ankle to the foot, and also provides attachment sites for muscles, ligaments, and tendons involved in foot movement and function. Injuries to the navicular bone can occur due to overuse or direct trauma, and may result in pain, swelling, and limited mobility. In severe cases, navicular fractures may require surgery and a lengthy rehabilitation period to restore proper foot function.",
      "Phalanx": "Phalanx is a term used to describe the bones of the fingers and toes. Each finger and toe has three phalanges, except for the thumb and big toe which have only two. The phalanges are named based on their location, with the bones closest to the hand or foot being called the proximal phalanx, the middle bone being called the middle phalanx, and the bone closest to the nail being called the distal phalanx. The phalanges are important for finger and toe movement and provide attachment sites for muscles, ligaments, and tendons involved in hand and foot function. Injuries to the phalanges can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications and maintain finger and toe function.",
      "Sesamoid": "Sesamoid bones are small, round bones that are embedded within certain tendons throughout the body, typically in areas where the tendon passes over a joint. They are named for their small, sesame seed-like appearance. The most common location for sesamoid bones is in the feet, specifically in the underside of the big toe joint. The function of sesamoid bones is to protect tendons from excessive wear and tear, improve leverage of muscles, and provide support and stability to the joints. Injuries to sesamoid bones can occur due to overuse or direct trauma, and may result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications and maintain joint function.",
      "Talus": "The Talus is a small, irregularly shaped bone located in the ankle joint, which connects the leg to the foot. The Talus is situated between the heel bone (calcaneus) and the two bones of the lower leg (tibia and fibula). It helps to transmit weight from the leg to the foot, and is important for ankle joint movement and stability. Injuries to the Talus can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. In severe cases, Talus injuries can lead to a condition known as Avascular Necrosis, which is characterized by the death of bone tissue due to loss of blood supply. Proper treatment and rehabilitation is important to prevent complications and maintain ankle function."
    }
  },
  {
    "name": "Hand",
    "informationText": "The bones of the hand are divided into three parts: the carpals (wrist bones), metacarpals (hand bones) and phalanges (finger bones). The carpals are eight small bones located at the base of the hand that form the wrist joint. They are the Scaphoid, Lunate, Triquetral, Pisiform, Trapezium, Trapezoid, Capitate, and Hamate.\nThe metacarpals are five long bones that run from the carpals to the phalanges and form the bones of the hand. They are numbered 1-5, starting from the thumb.\nThe metacarpals provide support and stability to the hand and also serve as attachment points for the muscles that control the movement of the fingers. The phalanges are the bones that form the fingrs and thumb. Each finger has three phalanges: the proximal, middle, and distal phalanges. The thumb only has two phalanges. ",
    "category": "skeletalSystem",
    "subModels": {
      "Capitate": "The Capitate is the largest of the carpal bones located in the wrist, and is situated in the center of the wrist between the scaphoid and the lunate bones. The Capitate helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. It is also an important bone for transmitting force from the wrist to the hand during gripping and grasping activities. Injuries to the Capitate can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications and maintain wrist function.",
      "Hamate": "The Hamate is a wedge-shaped bone located in the wrist. It is situated on the lateral (outer) side of the wrist, next to the fourth and fifth metacarpal bones. The Hamate is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Hamate helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Hamate can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. In severe cases, Hamate injuries can lead to a condition known as Hamate Fracture Syndrome, which is characterized by pain and numbness in the hand and wrist. Proper treatment and rehabilitation is important to prevent complications and maintain wrist function.",
      "Lunate": "The Lunate is a crescent-shaped bone located in the wrist. It is situated between the radius bone and the triquetral bone, and is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Lunate helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Lunate can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. In severe cases, Lunate injuries can lead to a condition known as Kienbock's disease, which is characterized by the death of bone tissue due to loss of blood supply. Proper treatment and rehabilitation is important to prevent complications and maintain wrist function.",
      "Metacarpal": "A Metacarpal is a long bone located in the hand, between the wrist bones (carpals) and the finger bones (phalanges). There are five metacarpals in each hand, numbered 1 to 5 from the thumb to the little finger. The metacarpals serve as a framework for the hand, providing support and stability while allowing for movement and flexibility. The metacarpals are also attachment sites for muscles and ligaments that control movement and grip strength. Injuries to the metacarpals can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications such as joint stiffness or deformity, and to maintain hand function.",
      "Phalanx": "A Phalanx (plural: phalanges) is a bone in the fingers or toes. It is a small, long bone that is cylindrical in shape and has a rounded end (proximal end) and a flattened end (distal end). The phalanges are arranged in series and are numbered 1 to 5, starting from the thumb or big toe, and going towards the little finger or little toe. The phalanges in the fingers have three parts: the proximal, middle, and distal phalanx, while the phalanges in the toes have only two parts: the proximal and distal phalanx. The phalanges are important for grip strength and dexterity, and injuries to these bones can result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications such as joint stiffness or deformity.",
      "Pisiform": "The Pisiform is a small, pea-shaped bone located in the wrist. It is situated on the medial (inner) side of the wrist, next to the triquetral bone. The Pisiform is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Pisiform helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Pisiform can occur due to direct trauma or overuse, and may result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications such as arthritis or nerve damage.",
      "Scaphoid": "The Scaphoid, also known as the navicular bone, is a small, boat-shaped bone located in the wrist. It is situated on the lateral (outer) side of the wrist, between the radius bone and the trapezium bone. The Scaphoid is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Scaphoid helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Scaphoid can be common and may include fractures, which can result in pain, swelling, and limited mobility. Proper treatment and rehabilitation is important to prevent complications such as arthritis or avascular necrosis (death of bone tissue due to loss of blood supply).",
      "Trapezium": "The Trapezium is a small, four-sided bone located in the wrist. It is situated on the lateral (outer) side of the wrist, between the scaphoid bone and the trapezoid bone. The Trapezium is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Trapezium helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Trapezium can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation.",
      "Trapezoid": "The Trapezoid is a small, four-sided bone located in the wrist. It is situated on the lateral (outer) side of the wrist, between the trapezium bone and the capitate bone. The Trapezoid is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Trapezoid helps to provide support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Trapezoid can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation.",
      "Triquetrum": "The Triquetrum is a small, triangular-shaped bone located in the wrist. It is situated on the lateral (outer) side of the wrist, between the pisiform bone and the lunate bone. The Triquetrum is one of the eight carpal bones that make up the wrist joint, which connects the hand to the forearm. The Triquetrum provides support and stability to the wrist joint and serves as an attachment site for several ligaments and tendons involved in wrist and hand movement. Injuries to the Triquetrum can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation."
    }
  },
  {
    "name": "Leg",
    "informationText": "The leg is made up of two bones: the femur and the tibia and fibula. The femur is the thigh bone and is the longest and strongest bone in the body. It runs from the hip to the knee and forms the hip joint at the top and the knee joint at the bottom. The tibia and fibula are the bones that run from the knee to the ankle and form the knee joint.\nThe tibia is the larger of the two bones and is located on the inner side of the leg, while the fibula is a smaller bone located on the outer side of the leg.The bones of the leg also protect the nerves and blood vessels that travel through the leg, allowing for sensation and movement of the foot and toes.",
    "category": "skeletalSystem",
    "subModels": {
      "Femur": "The Femur, commonly known as the thigh bone, is the longest and strongest bone in the human body. It extends from the hip joint to the knee joint and plays a crucial role in supporting the body's weight and facilitating movement. The femur is involved in several movements, such as walking, running, and jumping, and is supported by several muscles, tendons, and ligaments. The top of the femur forms the ball of the ball-and-socket hip joint, while the bottom of the femur forms the knee joint with the tibia (shin bone) and patella (kneecap). Injuries to the femur can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation.",
      "Fibula": "The Fibula, also known as the calf bone, is a long, thin bone located on the lateral (outer) side of the lower leg. It runs parallel to the tibia (shin bone) and plays a supportive role in the leg, helping to stabilize the ankle joint and provide attachment sites for several muscles involved in foot and ankle movement. The fibula is not involved in weight-bearing and can be fractured without causing significant issues with walking or standing. Injuries to the fibula can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation.",
      "Patella": "The Patella, commonly known as the kneecap, is a small, triangular-shaped bone located in front of the knee joint. It serves as a point of attachment for the quadriceps muscle, which is responsible for extending the leg, and helps to protect the knee joint and surrounding tissues. The patella also helps to improve the mechanical efficiency of the knee joint by increasing the angle at which the quadriceps muscle pulls on the tibia (shin bone). Injuries to the patella can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation.",
      "Tibia": "The Tibia, also known as the shin bone, is a long, weight-bearing bone located in the lower leg. It runs parallel to the fibula and plays an important role in supporting the body's weight and facilitating movement. The tibia forms the larger, more medial (inner) aspect of the knee joint, articulating with the femur (thigh bone) and patella (kneecap) to form the knee joint. The tibia is also involved in ankle joint movement and provides attachment sites for several muscles involved in leg and foot movement. Injuries to the tibia can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation."
    }
  },
  {
    "name": "Pelvic_Girdle",
    "informationText": "The pelvic girdle is a bony structure that forms the foundation of the spine and supports the upper body. It is made up of two hip bones (os coxae), which connect to the sacrum, a triangular bone at the base of the spine. The hip bones are formed by the fusion of three bones: the ilium, ischium, and pubis.\nThe pelvic girdle serves several important functions, including providing a stable base for the spine and supporting the weight of the upper body. It also serves as the attachment point for several muscles, including those of the hip, thigh, and lower back. These muscles work together to allow for a wide range of movements such as walking, running, and jumping.",
    "category": "skeletalSystem",
    "subModels": {
      "Hip": "The Hip Bone, also known as the pelvic bone, is a large, flat bone located at the base of the spine and between the femurs (thigh bones). The hip bone consists of three fused bones, the ilium, ischium, and pubis, and forms the socket for the ball-and-socket hip joint. The hip bone provides support for the body's weight and protects the internal organs of the pelvis, such as the bladder and reproductive organs. It also serves as an attachment site for several muscles involved in movement of the hip and thigh, such as the glutes and hip flexors. Injuries to the hip bone can result in pain, swelling, and limited mobility, and may require medical treatment and rehabilitation."
    }
  },
  {
    "name": "Shoulder_Girdle",
    "informationText": "The shoulder girdle, also known as the pectoral girdle, is a bony structure that connects the upper limb (arm) to the trunk of the body. It is made up of two bones: the scapula (shoulder blade) and the clavicle (collarbone). The scapula is a flat, triangular bone that sits on the back of the chest wall, while the clavicle is a long, slender bone that runs from the sternum (breastbone) to the scapula.\nThe shoulder girdle serves several important functions, including providing a stable base for the arm, allowing for a wide range of movements such as lifting, reaching, and grasping.",
    "category": "skeletalSystem",
    "subModels": {
      "Clavicle": "The Clavicle, commonly known as the collarbone, is a long, S-shaped bone located between the sternum (breastbone) and the scapula (shoulder blade). It serves as a bony strut that connects the upper limb to the axial skeleton and plays an important role in the movement and stability of the shoulder joint. The clavicle is involved in several arm movements, such as raising the arm overhead and rotating the shoulder, and helps to maintain the proper alignment of the shoulder joint. It also provides attachment sites for several muscles involved in arm and shoulder movement. Injuries to the clavicle are common and can result in pain, swelling, and limited movement in the arm and shoulder.",
      "Scapula": "The Scapula, commonly known as the shoulder blade, is a flat, triangular-shaped bone located in the upper back. It connects the upper arm bone (humerus) to the collarbone (clavicle) and is an important bone involved in the movement and stability of the shoulder joint. The scapula is involved in several arm movements, such as raising the arm overhead and rotating the shoulder. It also provides attachment sites for several muscles involved in arm, shoulder, and back movement. The scapula is often involved in shoulder injuries or dislocations and can be visualized through medical imaging, such as X-rays or MRIs, to diagnose any issues with the shoulder joint."
    }
  },
  {
    "name": "Vertebral_Column",
    "informationText": "The vertebral column is divided into five regions: cervical, thoracic, lumbar, sacral, and coccygeal. The cervical region, for example, has 7 vertebrae, it is the most mobile and flexible region of the spine, allowing for the head to move in all directions. The thoracic region has 12 vertebrae, it is the most stable region, and it connects the ribcage to the spine.\nThe lumbar region has 5 vertebrae, it is the most susceptible to stress, and it supports most of the body's weight. The sacral region has 5 fused vertebrae, it forms the back of the pelvic girdle and it has limited movement. The coccygeal region has 4 fused vertebrae, it forms the tailbone, and it doesn't have any movement.",
    "category": "skeletalSystem",
    "subModels": {
      "Atlas": "The atlas, also known as the first cervical vertebra or C1, is a unique vertebra in the neck region of the vertebral column. It is located between the skull and the second cervical vertebra (C2), and is the first of the seven cervical vertebrae. The atlas is named after the Greek god Atlas, who was known for holding up the world on his shoulders. Like the mythical Atlas, the atlas has a special role in supporting and stabilizing the head. The atlas is a small, ring-shaped vertebra that has no vertebral body or spinous process (a bony projection on the back of the vertebra). Instead, it has a pair of bony processes called the lateral masses, which provide attachment points for muscles and ligaments. The atlas also has a distinctive feature called the dens, which is a bony protuberance that extends upward from the vertebral body of the second cervical vertebra (C2). The head pivots around the dens when it moves, allowing the head to rotate and tilt in all directions.",
      "Axis": "The axis, also known as the second cervical vertebra or C2, is a unique vertebra in the neck region of the vertebral column. It is located between the atlas (C1) and the third cervical vertebra (C3) and is the second of the seven cervical vertebrae. The axis is named after the Greek god Atlas, who was known for holding up the world on his shoulders. Like the atlas, the axis has a special role in supporting and stabilizing the head. The axis has a distinctive feature called the odontoid process, also known as the dens, which is a bony protuberance that extends upward from the vertebral body. The atlas pivots around the dens when the head moves, allowing the head to rotate and tilt in all directions. The axis also has a number of bony processes, including the transverse processes, which provide attachment points for muscles and ligaments.",
      "Cervical_Vertebra": "The cervical vertebrae are a group of seven bones located in the neck region of the vertebral column. They are also known as the C-vertebrae. The cervical vertebrae are the smallest and most delicate of the vertebrae, as they are responsible for supporting the weight of the head and allowing it to move freely. They are also responsible for protecting the spinal cord, which runs through the vertebral foramen (a hole in the center of each vertebra) and carries messages between the brain and the rest of the body. Each cervical vertebra has a body, which is the main weight-bearing part of the bone, and a number of bony processes, which are protuberances that provide attachment points for muscles and ligaments. The vertebral body is round in shape and has a concave area on its back side, called the vertebral foramen, through which the spinal cord passes. The cervical vertebrae are separated from each other by intervertebral discs, which are made of cartilage and act as shock absorbers to protect the spine from damage.",
      "Coccyx": "The coccyx (plural: coccyges or coccyxes), commonly referred to as the tailbone, is the final segment of the vertebral column in all apes, and analogous structures in certain other mammals such as horses. In tailless primates (e.g. humans and other great apes) since Nacholapithecus (a Miocene hominoid), the coccyx is the remnant of a vestigial tail. In animals with bony tails, it is known as tailhead or dock, in bird anatomy as tailfan. It comprises three to five separate or fused coccygeal vertebrae below the sacrum, attached to the sacrum by a fibrocartilaginous joint, the sacrococcygeal symphysis, which permits limited movement between the sacrum and the coccyx.",
      "Lumbar_Vertebra": "The lumbar vertebrae are, in human anatomy, the five vertebrae between the rib cage and the pelvis. They are the largest segments of the vertebral column and are characterized by the absence of the foramen transversarium within the transverse process (since it is only found in the cervical region) and by the absence of facets on the sides of the body (as found only in the thoracic region). They are designated L1 to L5, starting at the top. The lumbar vertebrae help support the weight of the body, and permit movement.",
      "Sacrum": "The sacrum (plural: sacra or sacrums), in human anatomy, is a large, triangular bone at the base of the spine that forms by the fusing of the sacral vertebrae (S1–S5) between ages 18 and 30.The sacrum situates at the upper, back part of the pelvic cavity, between the two wings of the pelvis. It forms joints with four other bones. The two projections at the sides of the sacrum are called the alae (wings), and articulate with the ilium at the L-shaped sacroiliac joints. The upper part of the sacrum connects with the last lumbar vertebra (L5), and its lower part with the coccyx (tailbone) via the sacral and coccygeal cornua. The sacrum has three different surfaces which are shaped to accommodate surrounding pelvic structures. Overall it is concave (curved upon itself). The base of the sacrum, the broadest and uppermost part, is tilted forward as the sacral promontory internally. The central part is curved outward toward the posterior, allowing greater room for the pelvic cavity. In all other quadrupedal vertebrates, the pelvic vertebrae undergo a similar developmental process to form a sacrum in the adult, even while the bony tail (caudal) vertebrae remain unfused.",
      "Thoracic_Vertebra": "The thoracic vertebrae are a group of 12 bones in the vertebral column that are located in the chest region, between the cervical vertebrae in the neck and the lumbar vertebrae in the lower back. They are also known as the T-vertebrae. The thoracic vertebrae are larger and stronger than the cervical vertebrae, but smaller and less massive than the lumbar vertebrae. They are designed to support the weight of the upper body and to provide a stable foundation for the rib cage. Each thoracic vertebra has a body, which is the main weight-bearing part of the bone, and a number of bony processes, which are protuberances that provide attachment points for muscles and ligaments. The vertebral body is oval in shape and has a concave area on its back side, called the vertebral foramen, through which the spinal cord passes. The thoracic vertebrae are separated from each other by intervertebral discs, which are made of cartilage and act as shock absorbers to protect the spine from damage."
    }
  }
]
